import React from "react";
import styles from "./ThroughYears.module.css";
import arrowUpIcon from "../../assets/arrow-up.svg";
import AchievementItem from "./AchievementItem/AchievementItem";

const ThroughYears = () => {
  const achievementList = [
    {
      title: "1927 - 1947: Оснивање, раст и престанак рада Аеропута",
      content: [
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
      ],
    },
    {
      title: "1927 - 1947: Оснивање, раст и престанак рада Аеропута",
      content: [
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
      ],
    },
    {
      title: "1927 - 1947: Оснивање, раст и престанак рада Аеропута",
      content: [
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
      ],
    },
    {
      title: "1927 - 1947: Оснивање, раст и престанак рада Аеропута",
      content: [
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
      ],
    },
    {
      title: "1927 - 1947: Оснивање, раст и престанак рада Аеропута",
      content: [
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
      ],
    },
    {
      title: "1927 - 1947: Оснивање, раст и престанак рада Аеропута",
      content: [
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
        {
          header: "1927",
          text: "У јуну је основано Друштво за ваздушни саобраћај Аеропут. Национални авио-превозник Краљевине Срба, Хрвата и Словенаца, а потом Краљевине Југославије, Аеропут је био међу првим цивилним авио-компанијама - 10. у Европи и 21. у свету.",
        },
      ],
    },
  ];

  return (
    <section className={styles["achievement-section"]}>
      <h2>Године за памћење</h2>
      <ul className={styles["achievement-list"]}>
        {achievementList.map((item, index) => (
          <AchievementItem key={item.title + index} />
        ))}
      </ul>
    </section>
  );
};

export default ThroughYears;
